# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел. У пользователя
# необходимо запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.
#
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
#
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

rating = [12, 5, 5, 5, 4, 4, 2, 2, 1]

while True:
    try:
        print(f"Рейтинг - {rating}")

        user_rate = int(input("Введите число: "))

        if user_rate < 1:
            raise ValueError

        rating.append(user_rate)
        rating.sort(reverse=True)

    except ValueError:
        print("Ожидается натуральное число")
